## What are dataframes 

* How dataframes are created explanation using dictionaries

In [1]:
import pandas as pd

In [2]:
# Basic python dictionary
dogs = {
    'name':['Goldy','Snow','Jack','Tomm'],
    'breed':['Retriver','Huskey','shepard','Symoid'],
    'color':['Golden','White/Black','Brwon','White'],
    'age':[6,7,12,2],
}

In [3]:
dogs

{'name': ['Goldy', 'Snow', 'Jack', 'Tomm'],
 'breed': ['Retriver', 'Huskey', 'shepard', 'Symoid'],
 'color': ['Golden', 'White/Black', 'Brwon', 'White'],
 'age': [6, 7, 12, 2]}

In [4]:
dogs['name'][2]

'Jack'

#### Converting a Dict to a  pandas DataFrame

In [5]:
# Convert to a DF
df = pd.DataFrame(dogs)
df

    name     breed        color  age
0  Goldy  Retriver       Golden    6
1   Snow    Huskey  White/Black    7
2   Jack   shepard        Brwon   12
3   Tomm    Symoid        White    2

* A pandas series is basically a table column
* A Dataframe is a collection of multiple series

In [6]:
# Types
print(type(df))

print(type(df['name']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [16]:
# Get info about the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
name     4 non-null object
breed    4 non-null object
color    4 non-null object
age      4 non-null int64
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

#### Accessing specific values in a Data Frame

In [7]:
# Accessing values of a column

# Both methods work but top method is recommended
# Sometimes column name may be same as pandas attribute
# this may result in errors

df['breed']

# df.breed

0    Retriver
1      Huskey
2     shepard
3      Symoid
Name: breed, dtype: object

In [8]:
# Accessing multiple columns

# use double square brackets

df[['breed','color']]

      breed        color
0  Retriver       Golden
1    Huskey  White/Black
2   shepard        Brwon
3    Symoid        White

In [9]:
# Get all columns and details
df.columns

Index(['name', 'breed', 'color', 'age'], dtype='object')

In [10]:
# Accessing Rows

# iloc = int location

# syntax
# {df_name}.iloc[index]
df.iloc[0]

name        Goldy
breed    Retriver
color      Golden
age             6
Name: 0, dtype: object

In [11]:
# multiple rows using iloc 
df.iloc[[0,2]]

    name     breed   color  age
0  Goldy  Retriver  Golden    6
2   Jack   shepard   Brwon   12

In [12]:
# Get multiple rows and column

# {dataframe_name}.iloc[[row_index],[column_index]]
df.iloc[[0,2,1],[2,0,1]]

         color   name     breed
0       Golden  Goldy  Retriver
2        Brwon   Jack   shepard
1  White/Black   Snow    Huskey

In [13]:
# Accessing rows with loc
# label location

df.loc[1]

name            Snow
breed         Huskey
color    White/Black
age                7
Name: 1, dtype: object

In [14]:

df.loc[[3,2,1,0],['name','breed']]

# Thiese two are same

# df.iloc[[3,2,1,0],[0,1]]

    name     breed
3   Tomm    Symoid
2   Jack   shepard
1   Snow    Huskey
0  Goldy  Retriver